Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Suppose you’ve decided that your issue #53 work is complete and ready to be merged into your `master` branch.
cs: Předpokládejme, že jste dokončili práci na chybě č. 53 a nyní byste ji rádi začlenili do větve `master`.

source: Suppose you’ve done an import from another source control system and have subdirectories that make no sense (trunk, tags, and so on).
cs: Předpokládejme, že jste dokončili import z jiného systému ke správě zdrojového kódu a máte podadresáře, které nedávají žádný smysl (trunk, tags apod.).

source: Switch back to your original story and continue working.
cs: Přepnete zpět na svou původní část a pokračujete v práci.

source: Switch back to your production branch.
cs: Vrátíte se zpět na produkční větev.

source: Switching branches with submodules in them can also be tricky.
cs: Problematické může být také přepínání větví obsahujících submoduly.

source: Table 2-1 lists some of the more useful options that format takes.
cs: Tabulka 2-1 uvádí některé užitečné parametry, které format akceptuje.

source: Table 2-2 lists the options we’ve covered so far and some other common formatting options that may be useful, along with how they change the output of the `log` command.
cs: Tabulka 2-2 uvádí parametry, které jsme už zmínili, a některé další běžné parametry formátování, které mohou být užitečné. Pravý sloupec popisuje, jak který parametr změní výstup `log`u.

source: Take a history like Figure 3-31, for example.
cs: Vezměme například historii na obrázku 3-31.

source: Take the contents of the public key of that pair, and paste it into the SSH Public Key text box.
cs: Vezměte obsah veřejného klíče z daného páru a vložte ho do textového pole „SSH Public Key“.

source: Technically you won’t lose the work, but you won’t have a branch pointing to it, so it will be somewhat difficult to retrieve.
cs: Technicky vzato práci neztratíte, ale nebude žádná větev, která by na ni ukazovala, a tak bude poněkud obtížené získat práci zpět.

source: Technically, `git am` is built to read an mbox file, which is a simple, plain-text format for storing one or more e-mail messages in one text file.
cs: Příkaz `git am` je technicky koncipován tak, aby přečetl soubor mbox, tj. formát prostého textu pro ukládání jedné či více e-mailových zpráv do jednoho textového souboru.

source: Technically, you can do that by explicitly figuring out the common ancestor and then running your diff on it:
cs: Můžete tedy explicitně najít společného předka obou větví a spustit na něm příkaz diff:

source: That approach lets you do more complex things like deny non-fast-forwards to a certain subset of users.
cs: Tato metoda umožňuje pokročilejší nastavení, jako zamítnutí jiných aktualizací než „rychle vpřed“ určité skupině uživatelů.

source: That being said, many Git servers authenticate using SSH public keys.
cs: Mnoho serverů Git provádí ověřování totožnosti pomocí veřejných SSH klíčů.

source: That change will be rejected until you merge in their work.
cs: Jejich změna bude odmítnuta, dokud nezačlení dříve odeslanou práci.

source: That command compares what is in your working directory with what is in your staging area.
cs: Tento příkaz srovná obsah vašeho pracovního adresáře a oblasti připravených změn.

source: That command did two things.
cs: Tento příkaz provedl dvě věci.

source: That command does the same thing as the previous one, but the target directory is called `mygrit`.
cs: Tento příkaz učiní totéž co příkaz předchozí, ale cílový adresář se bude jmenovat `mygrit`.

source: That commit is when this file was first added to this project, and those lines have been unchanged since.
cs: Tato revize vznikla prvním přidáním tohoto souboru do projektu a tyto řádky zůstaly od té doby nezměněny.

source: That creates a directory named `grit`, initializes a `.git` directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.
cs: Tímto příkazem se vytvoří adresář s názvem `grit`, inicializuje se v něm adresář `.git`, stáhnou se všechna data pro tento repozitář a vytvoří se pracovní kopie nejnovější verze.

source: That drops you into your text editor, which has your last commit message in it, ready for you to modify the message.
cs: Tím se přesunete do textového editoru, v němž bude otevřena vaše poslední zpráva k revizi. Nyní ji můžete upravit.

source: That gives you the log output in XML format — you can look for the authors, create a unique list, and then strip out the XML.
cs: Vytvoříte tím log ve formátu XML. Můžete v něm vyhledávat autory, vytvořit si vlastní seznam a XML zase vyjmout.

source: That gives you your next commit object.
cs: Tím získáte další objekt revize.

source: That installs a couple of executables that Gitosis will use.
cs: Tímto příkazem nainstalujete několik spustitelných souborů, které bude Gitosis používat.

source: That is a simple example you’re likely to encounter.
cs: S uvedeným jednoduchým případem se pravděpodobně setkáte.

source: That is a special mode in Git that basically means you’re recording a commit as a directory entry rather than a subdirectory or a file.
cs: Jedná se o speciální režim systému Git, který udává, že revizi zaznamenáváte jako adresář, ne jako podadresář nebo soubor.

source: That is a very basic case of the transfer protocols.
cs: Toto jsou pouze základní případy přenosových protokolů.

source: That is a very useful syntax to remember.
cs: Určitě uděláte dobře, pokud si tuto syntaxi zapamatujete.

source: That is all a lightweight tag is — a branch that never moves.
cs: To je celá prostá značka – větev, která se nikdy nepřemisťuje.

source: That is one of the simplest workflows.
cs: Toto je jeden z nejjednodušších pracovních postupů.

source: That is probably the simplest workflow, but it’s problematic if you’re dealing with larger repositories or projects.
cs: Jedná se patrně o nejjednodušší pracovní postup. Je však problematický, pokud ho používáme u velkých repozitářů nebo projektů.

source: That is, the most recent commits show up first.
cs: Nejnovější revize tak budou uvedeny nahoře.

source: That is, you can specify that certain people (or groups of people) can only push certain "refs" (branches or tags) but not others.
cs: To znamená, že lze nastavit, aby určití lidé mohli odesílat jen do určité větve (nebo určité značky; obecně „refs“), ale do jiné ne.

source: That is, you’ll learn how to contribute code successfully to a project and make it as easy on you and the project maintainer as possible, and also how to maintain a project successfully with a number of developers contributing.
cs: Naučíte se tedy, jak úspěšně přispívat svým kódem do projektů a jak to učinit co nejjednodušeji pro vás i správce projektu. Dále se dozvíte, jak efektivně spravovat projekt, do nějž přispívá velký počet vývojářů.

source: That last command creates new Git repository called `gitolite-admin` on the server.
cs: Poslední příkaz vytvoří na serveru nový gitovský repozitář nazvaný `gitolite-admin`.

source: That means Gitosis recognized you but shut you out because you’re not trying to do any Git commands.
cs: To znamená, že vás Gitosis sice rozpoznal, ale nedovolí vám přístup, protože se nepokoušíte zadat žádný příkaz Git.

source: That means when I host my `grit` project on GitHub, you won’t find it at `github.com/grit` but instead at `github.com/schacon/grit`.
cs: To znamená, že pokud budu hostovat svůj projekt `grit` na serveru GitHub, nenajdete ho na adrese `github.com/grit`, ale jako `github.com/schacon/grit`.

source: That means you can do things such as
cs: Můžete tak zadat například příkaz ve tvaru:

source: That pulls down the work John has pushed up in the meantime.
cs: Tím stáhne práci, kterou mezitím odeslal John.

source: That returns an integer value for the date of each directory.
cs: Tím dostanete celé číslo pro data každého adresáře.

source: That rule will just get added to the ruleset for the `gitolite` repository.
cs: Toto pravidlo se pak přidá do skupiny pravidel repozitáře `gitolite`.

source: That shows the tagger information, the date the commit was tagged, and the annotation message before showing the commit information.
cs: Příkaz zobrazí ještě před informacemi o revizi informace o autorovi značky, datu, kdy byla revize označena, a zprávu značky.

source: That shows you where the branch tip was yesterday.
cs: Git vám ukáže, kde se vrchol větve nacházel včera.

source: That starts up an HTTPD server on port 1234 and then automatically starts a web browser that opens on that page.
cs: Tím spustíte HTTPD server na portu 1234 a automaticky se spustí webový prohlížeč, který otevře tuto stránku.

source: That way, the maintainer doesn’t have to do any integration work — just a fast-forward or a clean apply.
cs: Správce v tomto případě nemusí provádět žádnou integraci, provede pouze posun „rychle vpřed“ nebo čistou aplikaci.

source: That way, they can correct any problems before committing and before those issues become more difficult to fix.
cs: Všechny problémy tak budou moci opravit, dokud to ještě není příliš složité a dokud je nezapsali do revize.

source: That way, you can use private branches for work you don’t want to share, and push up only the topic branches you want to collaborate on.
cs: Tímto způsobem si můžete zachovat soukromé větve pro práci, kterou nehodláte sdílet, a odesílat pouze tematické větve, na nichž chcete spolupracovat.

source: That way, you don’t litter the project with `.gitignore` files.
cs: Díky tomu si nemusíte projekt znečišťovat soubory `.gitignore`.

source: That’s 1,200 times the number of grains of sand on the earth.
cs: To je 1200násobek počtu všech zrnek písku na celé Zemi.

source: That’s a pretty nice trick and may save you some time and documentation reading.
cs: Jedná se o užitečný trik, který vám může ušetřit čas a pročítání dokumentace.

source: That’s all we’ll cover about GitHub, but it’s important to note how quickly you can do all this.
cs: O serveru GitHub je to vše. Ještě jednou bych rád zdůraznil, že všechny tyto kroky lze provést opravdu velmi rychle.

source: That’s all.
cs: A to je vše.

source: That’s basically what a branch in Git is: a simple pointer or reference to the head of a line of work.
cs: A to je také skutečná podstata větví v systému Git. Jedná se o jednoduché ukazatele, neboli reference na „hlavu“ (angl. head) jedné linie práce.

source: That’s it — you’ve created a valid Git blob object.
cs: A je hotovo. Právě jste vytvořili platný objekt blobu Git.

source: That’s it.
cs: A to je celé.

source: That’s why `git push` and `git pull` work out of the box with no other arguments.
cs: To je také důvod, proč příkazy `git push` a `git pull` fungují samy od sebe i bez dalších parametrů.

source: The Commits tab shows a list of commits in reverse chronological order, similar to the output of the `git log` command.
cs: Záložka „Commits“ zobrazuje seznam revizí v obráceném chronologickém pořadí, podobně jako výstup příkazu `git log`.

source: The Downloads tab allows you to upload project binaries and link to tarballs and zipped versions of any tagged points in your project.
cs: Záložka „Downloads“ umožňuje nahrávat binární soubory k projektu a přidávat odkazy na tarbally a komprimované verze všech míst ve vašem projektu, které jsou označeny značkou (tagem).

source: The Git daemon checks that the command can be run and that the repository exists and has public permissions.
cs: Démon Git zkontroluje, zda je příkaz skutečně možné spustit, zda existuje daný repozitář a zda jsou oprávnění k němu veřejná.

source: The Git data is served as basic static files (see Chapter 9 for details about exactly how it’s served).
cs: Data repozitáře Git jsou obsluhována jako obyčejné statické soubory (podrobnosti o přesném způsobu obsluhy naleznete v kapitole 9).

source: The Git directory is where Git stores the metadata and object database for your project.
cs: Adresář Git (repozitář) je místo, kde Git uchovává metadata a databázi objektů vašeho projektu.

source: The Git project also has a `maint` branch that is forked off from the last release to provide backported patches in case a maintenance release is required.
cs: Projekt Git má kromě toho větev `maint`, která byla odštěpena z posledního vydání a představuje záplaty backportované pro případ, že by bylo třeba vydat opravnou verzi.

source: The Git project has four long-running branches: `master`, `next`, and `pu` (proposed updates) for new work, and `maint` for maintenance backports.
cs: Váš projekt Git má čtyři trvalé větve: `master`, `next` a `pu` (proposed updates, tj. návrh aktualizací) pro novou práci a `maint` pro backporty správy.

source: The Git project has well-formatted commit messages — I encourage you to run `git log --no-merges` there to see what a nicely formatted project-commit history looks like.
cs: Projekt Git obsahuje kvalitně naformátované zprávy k revizím. Mohu vám doporučit, abyste v něm zkusili zadat příkaz `git log --no-merges` a podívali se, jak vypadá pěkně naformátovaná historie revizí projektu.

source: The Git project provides a document that lays out a number of good tips for creating commits from which to submit patches — you can read it in the Git source code in the `Documentation/SubmittingPatches` file.
cs: Projekt Git obsahuje dokument, v němž je navržena celá řada dobrých tipů pro vytváření revizí, z nichž se skládají jednotlivé záplaty. Dokument najdete ve zdrojovém kódu systému Git v souboru `Documentation/SubmittingPatches`.

source: The Git project requires that the more detailed explanation include your motivation for the change and contrast its implementation with previous behavior — this is a good guideline to follow.
cs: Projekt Git vyžaduje, aby podrobnější popis revize obsahoval vaši motivaci ke změnám a vymezil jejich implementaci na pozadí předchozích kroků. Tuto zásadu je dobré dodržovat.

source: The Git protocol is far more efficient and thus faster than the HTTP protocol, so using it will save your users time.
cs: Protokol Git je daleko výkonnější, a proto také rychlejší než protokol HTTP, takže uživatelům ušetří nějaký čas.

source: The Git protocol is the fastest transfer protocol available.
cs: Protokol Git je ze všech dostupných protokolů nejrychlejší.

source: The Git source repo, for instance, contains more than 240 tags.
cs: Například zdrojový kód Git „repo“ obsahuje více než 240 značek.

source: The GitHub plan page.
cs: Výběr typu účtu na serveru GitHub

source: The GitHub user dashboard.
cs: Uživatelský ovládací panel na serveru GitHub

source: The GitHub user signup form.
cs: Registrační formulář na serveru GitHub

source: The GitWeb web-based user interface.
cs: Online uživatelské rozhraní GitWeb

source: The Graphs tab has some contribution visualizations and statistics about your project.
cs: Záložka „Graphs“ graficky zobrazuje některé příspěvky a statistiky k vašemu projektu.

source: The HEAD file is a symbolic reference to the branch you’re currently on.
cs: Soubor HEAD je symbolická reference na větev, na níž se právě nacházíte.

source: The HTTP method is simple but a bit inefficient.
cs: Metoda přenosu HTTP je jednoduchá, avšak málo výkonná.

source: The HTTP protocol also isn’t very resource intensive on your server.
cs: Protokol HTTP navíc jen minimálně omezuje zdroje serveru.

source: The Linux kernel is an open source software project of fairly large scope.
cs: Jádro Linuxu je software celkem velkého rozsahu, s otevřeným kódem.

source: The Linux kernel repository also has a non-commit-pointing tag object — the first tag created points to the initial tree of the import of the source code.
cs: Také jádro Linuxu obsahuje objekt značky, který neukazuje na revizi. První vytvořená značka ukazuje na první strom importu zdrojového kódu.

source: The Network tab shows all the people who have forked your project and contributed back.
cs: Záložka „Network“ zobrazuje všechny uživatele, kteří se odštěpili od vašeho projektu a zase do něj přispěli.

source: The Public Clone URL is a public, read-only Git URL over which anyone can clone the project.
cs: „Public Clone URL“ je veřejná adresa Git pouze pro čtení, na níž si může váš projekt kdokoli naklonovat.

source: The SHA-1 digest is 20 bytes or 160 bits.
cs: Otisk SHA-1 má 20 bytů, neboli 160 bitů.

source: The SHA-1 value of all '0's means that nothing was there before — because you’re adding the experiment reference.
cs: Hodnota SHA-1 ze samých nul znamená, že na tomto místě předtím nic nebylo, protože přidáváte větev „experiment“.

source: The Subversion bridge is the gateway drug to the DVCS world.
cs: Most k systému Subversion je branou do světa DVCS.

source: The Wiki tab provides a wiki where you can write documentation or other information about your project.
cs: Záložka „Wiki“ vám nabízí stránku wiki, kam můžete napsat dokumentaci nebo jiné informace ke svému projektu.

source: The Your Clone URL is a read/write SSH-based URL that you can read or write over only if you connect with the SSH private key associated with the public key you uploaded for your user.
cs: „Your Clone URL“ je SSH adresa ke čtení a zápisu, přes níž můžete číst a zapisovat. To však pouze v případě, že se připojíte se soukromým klíčem SSH asociovaným s veřejným klíčem, který jste zadali pro svého uživatele.

source: The _author_ is the person who originally wrote the patch, whereas the _committer_ is the person who last applied the patch.
cs: _Autor_ (author) je osoba, která práci původně napsala, zatímco _autor revize_ (committer) je osoba, která práci zapsala do repozitáře.

source: The `*` next to each file means the file is selected to be staged.
cs: Znak `*` vedle souborů znamená, že je soubor vybrán jako připravený k zapsání.

source: The `+` tells Git to update the reference even if it isn’t a fast-forward.
cs: Znak `+` systému Git říká, aby aktualizoval referenci i v případě, že nesměřuje „rychle vpřed“.

source: The `--author` option allows you to filter on a specific author, and the `--grep` option lets you search for keywords in the commit messages.
cs: Parametr `--author` umožňuje filtrovat výpisy podle konkrétního autora, pomocí parametru `--grep` můžete ve zprávách k revizím vyhledávat klíčová slova.

source: The `--ignore-unmatch` option to `git rm` tells it not to error out if the pattern you’re trying to remove isn’t there.
cs: Zadáte-li k příkazu `git rm` parametr `--ignore-unmatch`, nařídíte systému Git, aby nepovažoval za chybu, jestliže nenajde vzor, který se snažíte odstranit.

source: The `--index-filter` option is similar to the `--tree-filter` option used in Chapter 6, except that instead of passing a command that modifies files checked out on disk, you’re modifying your staging area or index each time.
cs: Parametr `--index-filter` je podobný parametru `--tree-filter`, který jsme používali v kapitole 6, jen s tím rozdílem, že příkazem nezměníte soubory načtené na disku, ale oblast připravených změn, čili index.

source: The `--no-commit` option tells Git not to automatically record a commit.
cs: Parametr `--no-commit` říká systému Git, aby revizi automaticky nezaznamenával.

source: The `--squash` option takes all the work on the merged branch and squashes it into one non-merge commit on top of the branch you’re on.
cs: Parametr `--squash` (komprimovat) vezme všechnu vaši práci v začleněné větvi a zkomprimuje ji do jedné revize, která nevznikla jako výsledek sloučení a leží na vrcholu větve, na níž se právě nacházíte.

source: The `--tree-filter` option runs the specified command after each checkout of the project and then recommits the results.
cs: Parametr `--tree-filter` spustí zadaný příkaz po každém checkoutu projektu a znovu zapíše jeho výsledky.

source: The `-M` switch tells Git to look for renames.
cs: Přepínač `-M` řekne systému Git, aby zkontroloval případné přejmenování.

source: The `-T trunk -b branches -t tags` part tells Git that this Subversion repository follows the basic branching and tagging conventions.
cs: Část `-T trunk -b branches -t tags` říká systému Git, že tento repozitář Subversion dodržuje základní zásady větvení a značkování.

source: The `-m` specifies a tagging message, which is stored with the tag.
cs: Parametr `-m` udává zprávu značky, která bude uložena spolu se značkou.

source: The `-w` tells `hash-object` to store the object; otherwise, the command simply tells you what the key would be.
cs: Parametr `-w` sděluje příkazu `hash-object`, aby objekt uložil. Bez parametru by vám příkaz jen sdělil, jaký klíč by byl přidělen.

source: The `.pub` file is your public key, and the other file is your private key.
cs: Soubor `.pub` je váš veřejný klíč, druhý soubor je soukromý klíč.

source: The `Author` information is the individual who originally created the patch and when it was originally created.
cs: Informace `Author` naproti tomu označuje jedince, který patch původně vytvořil, a kdy tak učinil.

source: The `Commit` information indicates the person who applied the patch and the time it was applied.
cs: Informace `Commit` uvádí osobu, která patch aplikovala, a čas, kdy se tak stalo.

source: The `SHA^@` syntax resolves to all the parents of that commit.
cs: Syntaxe `SHA^@` se vztahuje na všechny rodiče této revize.

source: The `benchmarks.rb` file appears under a section named “Changes not staged for commit” — which means that a file that is tracked has been modified in the working directory but not yet staged.
cs: Soubor `benchmarks.rb` je uveden v části „Changes not staged for commit“ (změny, které nejsou připraveny k zapsání). Znamená to, že soubor, který je sledován, byl v pracovním adresáři změněn, avšak ještě nebyl připraven k zapsání (staged).

source: The `benchmarks.rb` file is modified but once again unstaged.
cs: Soubor `benchmarks.rb` má stav „změněn“, ale už se nenachází v oblasti připravených změn.

source: The `bisect` command does a binary search through your commit history to help you identify as quickly as possible which commit introduced an issue.
cs: Příkaz `bisect` zahájí binární vyhledávání ve vaší historii revizí a pomůže vám co nejrychleji identifikovat, která revize je původcem problému.

source: The `branches` directory isn’t used by newer Git versions, and the `description` file is only used by the GitWeb program, so don’t worry about those.
cs: Adresář `branches` se už v novějších verzích systému Git nepoužívá a soubor `description` používá pouze program GitWeb, takže o tyto dvě položky se nemusíte starat.

source: The `cat` program is basically a no-op: it spits out the same data that it gets in.
cs: Program `cat` ve své podstatě nic neudělá: jeho výstupem jsou stejná data, která tvořila vstup.

source: The `color.ui = true` setting is almost always what you’ll want to use.
cs: Téměř vždy vystačíte s příkazem `color.ui = true`.

source: The `commit-msg` hook takes one parameter, which again is the path to a temporary file that contains the current commit message.
cs: Zásuvný modul `commit-msg` používá jeden parametr, jímž je cesta k dočasnému souboru obsahujícímu aktuální zprávu k revizi.

source: The `config` file contains your project-specific configuration options, and the `info` directory keeps a global exclude file for ignored patterns that you don’t want to track in a `.gitignore` file.
cs: Soubor `config` obsahuje konfigurační nastavení vašeho projektu a v adresáři `info` je uložen globální soubor `exclude` s maskami ignorovaných souborů a adresářů, které chcete explicitně ignorovat prostřednictvím souboru `.gitignore`.
